{"Promotions":{"promotions":{"19876325":{"id":19876325,"promotionName":"LapsedAppUsersSUPC_Oct","description":"Enjoy 20% off select regular, sale & clearance priced items!","global":false,"promotionType":"Percent Off Order","effectiveDate":"09/26/2017 12:00:00 AM ","expirationDate":"01/06/2018 11:59:59 PM ","promotionCode":"XCG732JTP4","legalDisclaimer":"EXCLUDES: Deals of the Day, Doorbusters, Everyday Values (EDV), Last Act, Macy's Backstage, specials, Super Buys, athletic clothing/shoes/accessories, baby gear, bridal salons, reg.-priced china/crystal/silver, cosmetics/fragrances, designer handbags, designer jewelry/watches, designer sportswear, electrics/electronics, furniture/mattresses, gift cards, gourmet foods, jewelry trunk shows, premium denim, previous purchases, restaurants, rugs, select licensed depts., services, smart watches/jewelry, special orders, special purchases, sterling silver, select tech accessories, toys, wine, 3Doodler, American Rug Craftsmen, Apple Products, Ashley Graham, Avec Les Filles clothing, Barbour, Brahmin, Breville, Brooks Brothers Red Fleece, COACH, Demeyere, Destination Maternity, Dyson, Eileen Fisher SYSTEM, Fitbit, Frye, Ghurka, Hanky Panky, Jack Spade, John Varvatos, Karastan, kate spade new york, Kenneth Cole shoes, KitchenAid Pro Line, Le Creuset, Levis, littleBits, Locker Room By Lids, Marc Jacobs, select Michael Kors/Michael Michael Kors, Michele watches, Miyabi, Movado Bold, Natori, Nike swim, NYDJ, Original Penguin, Panache, Rimowa, Rudsak, Sam Edelman, Shun, Spanx, Staub, Stuart Weitzman, Tempur-Pedic mattresses, The North Face, Theory, Tommy John, Tory Burch, Tumi, UGG®, Vans, Vitamix, Wacoal, Wolford, Wüsthof & products offered by vendors who operate leased departments in any of our stores including: Burberry, Gucci, Longchamp & Louis Vuitton. PLUS, REGULAR-PRICED IN STORE: bridal dresses, bridge dresses, bridge sportswear, shoes, sterling flatware, watches, Breitling, Catherine Catherine Malandrino, CeCe, DKNY, Dooney & Burke, Eileen Fisher, Emporio Armani, Fame & Partners, Impulse contemporary apparel, Juicy Couture, Karen Kane, Lacoste, Lalique, Lauren/Polo/Ralph Lauren, Lladro, Michael Aram, Sperry, Swarovski, Vera Wang Wedgwood, Vince Camuto apparel & Waterford; PLUS, ONLINE ONLY, ALL: bridal dresses, bridge dresses, bridge sportswear, designer handbags/shoes, kids shoes, sterling flatware, watches, Allen Edmonds, Birkenstock, Breitling, Catherine Catherine Malandrino, CeCe, DKNY, Dooney & Bourke, Eileen Fisher, Emporio Armani, Fame & Partners, Impulse contemporary apparel, Hurley, Johnston & Murphy, Juicy Couture, Karen Kane, Lacoste, Lalique, Lauren/Polo/Ralph Lauren, Lladro, Merrell, Michael Aram, RVCA, Sperry, Swarovski, Tommy Bahama, Vera Wang Wedgwood, Vince Camuto apparel & Waterford. Valid for Macys Cardholders only. Must use Macys card or Macys Gift, Rewards or EZ Exchange Card & show Macys Credit Card at time of purchase. Cant be combined with savings pass/coupon/extra discount/credit offer except opening new Macys account. Cant be used as payment or credit on your account. Extra Savings % applied to reduced prices. Valid in store any single day & one time on macys.com.","offerDescription":"","promotionCodeIds":[],"promotionAttribute":[{"promotionID":19876325,"promotionAttributeName":"PROMOTION_FINAL_COST","attributeSeqNumber":1,"attributeValue":[{"promotionID":19876325,"attributeValueSeqNumber":1,"promotionAttributeName":"PROMOTION_FINAL_COST","attributeValue":"Never Show"}]}],"validWithOtherPromotions":true,"incompatiblePromotionIds":[],"sequenceNumber":0,"maxTimesToApply":0,"gwp":false},"19879284":{"id":19879284,"promotionName":"RED TEXT PROMO: Free Shipping at $49","description":"Enjoy free shipping when you spend $49 or more! See exclusions for details.","global":true,"promotionType":"Free Shipping","effectiveDate":"12/25/2017 12:00:00 AM ","expirationDate":"12/28/2017 11:59:59 PM ","legalDisclaimer":"TO GET FREE SHIPPING WITH $49 PURCHASE: Place $49 of qualifying items in shopping bag. No promo code needed. Ends December 28, 2017. The minimum purchase amount for Free Shipping does not include gift wrap charges, purchases of Gift Cards or tax. Offer applies to Standard Shipping to one location and may be applied to Premium or Overnight Shipping for an upgrade fee. Free Shipping does not apply to furniture, mattresses, oversized rugs, purchases in Macy's stores, prior purchases or international orders. A $10 shipping surcharge on domestic orders applies to customers living outside the contiguous United States: Hawaii, Alaska, Puerto Rico, Guam, American Samoa, Micronesia, Marshall Islands, North Mariana Islands, Palau and U.S. Virgin Islands. Due to size and/or weight, certain items bear a shipping surcharge, which will still apply. When shipping to multiple addresses, only shipping to the first address will qualify for Free Shipping; Standard Shipping will apply to all other addresses. Free Shipping cannot be applied to purchases being shipped to U.S. territories or APO/FPO addresses. Restricted items include aerosols, pressurized spray cans and alcohol-based products (hairspray, nail polish, nail polish remover, shaving cream, etc.). Due to air transport restrictions and regulations, these items are required by the U.S. Department of Transportation to be shipped by Standard Ground Shipping only. These restricted items are not eligible for Premium or Overnight Shipping. TO GET FREE RETURNS: You can return merchandise by mail or in store for a full refund, which will be credited on your original tender. Free Returns exclude gift cards, food, gourmet gifts, lamps, wall art, mirrors, furniture, mattresses & area rugs. Does not apply to international orders. Gift returns or orders with different shipping & billing information or purchased with a Gift Card are refunded on an Easy Exchange Card, which you can use for future online or in-store purchases.","offerDescription":"Enjoy Free Shipping at $49! See exclusions.","promotionCodeIds":[],"promotionAttribute":[{"promotionID":19879284,"promotionAttributeName":"BADGE_TEXT","attributeSeqNumber":1,"attributeValue":[{"promotionID":19879284,"attributeValueSeqNumber":1,"promotionAttributeName":"BADGE_TEXT","attributeValue":"Free ship at $49"}]},{"promotionID":19879284,"promotionAttributeName":"PROMO_ASSOCIATED_FOB_ID","attributeSeqNumber":1,"attributeValue":[{"promotionID":19879284,"attributeValueSeqNumber":1,"promotionAttributeName":"PROMO_ASSOCIATED_FOB_ID","attributeValue":"1000"}]}],"validWithOtherPromotions":true,"incompatiblePromotionIds":[],"sequenceNumber":0,"maxTimesToApply":0,"gwp":false},"19879410":{"id":19879410,"promotionName":"SITEWIDE NFC: Transition Direct Mailer 20%","description":"Extra 20% off clothing, accessories, jewelry & home items with exclusions during our Style event!","global":false,"promotionType":"Percent Off Order","effectiveDate":"12/26/2017 12:00:00 AM ","expirationDate":"01/01/2018 11:59:59 PM ","promotionCode":"STYLE","legalDisclaimer":"Extra 20% off clothing, accessories, jewelry & home items. Extra 15% off watches. Exclusions apply. Valid 12/26/17-1/1/18 with your Macys Card or pass. Macys.com promo code: STYLESavings off regular-priced & sale items in store and regular-priced, sale & clearance items onlineEXCLUDES ALL: Deals of the Day, Doorbusters, Everyday Values (EDV), Last Act, Macys Backstage, specials, Super Buys, athletic clothing/shoes/accessories, baby gear, bridal salons, reg.-priced china/crystal/silver, cosmetics/fragrances, designer handbags, designer jewelry/watches, designer sportswear, electrics/electronics, furniture/mattresses, gift cards, gourmet foods, jewelry trunk shows, premium denim, previous purchases, restaurants, rugs, select licensed depts., services, smart watches/jewelry, special orders, special purchases, sterling silver, select tech accessories, toys, wine, 3Doodler, American Rug Craftsmen, Anova, Apple Products, Ashley Graham, Avec Les Filles clothing, Barbour, Brahmin, Breville, Briggs & Riley, Brooks Brothers Red Fleece, COACH, Demeyere, Destination Maternity, Dyson, Eileen Fisher SYSTEM, Fitbit, Frye, Ghurka, Global Cutlery, Hanky Panky, Jack Spade, Judith Leiber, John Varvatos, Karastan, kate spade new york, Kenneth Cole mens shoes, Kiehls, KitchenAid Pro Line, Le Creuset, Levis, littleBits, Locker Room By Lids, Marc Jacobs, select Michael Kors/Michael Michael Kors, Michele watches, Miyabi, Movado Bold, Natori, Nike swim, NYDJ, Original Penguin, Panache, Rimowa, Rudsak, Sam Edelman, Shun, Spanx, Staub, Stuart Weitzman, Swell, Tempur-Pedic mattresses, The North Face, Theory, Tommy John, Tory Burch, Tumi, UGG®, Vans, Vitamix, Wacoal, Wolford, Wüsthof & products offered by vendors who operate leased departments in any of sour stores including: Burberry, Gucci, Longchamp & Louis Vuitton. PLUS, REGULAR-PRICED IN STORE: bridal dresses, bridge dresses, bridge sportswear, shoes, sterling flatware, watches, Breitling, Catherine Catherine Malandrino, CeCe, DKNY, Dooney & Bourke, Eileen Fisher, Emporio Armani, Fame & Partners, Impulse contemporary apparel, Juicy Couture, Karen Kane, Lacoste, Lalique, Lauren/Polo/Ralph Lauren, Lladro, Michael Aram, Vera Wang Wedgwood, Vince Camuto apparel & Waterford; PLUS, ONLINE ONLY, ALL: kids shoes, Allen Edmonds, Birkenstock, Hurley, Johnston & Murphy, Merrell, RVCA, Sperry, Swarovski, Tommy Bahama. Cant be combined with savings pass/coupon/extra discount/credit offer except opening new Macys account. Cant be used as payment or credit on your account. Extra Savings % applied to reduced prices. Valid in store any single day & one time on macys.com.","offerDescription":"","promotionCodeIds":[],"promotionAttribute":[{"promotionID":19879410,"promotionAttributeName":"PROMOTION_FINAL_COST","attributeSeqNumber":1,"attributeValue":[{"promotionID":19879410,"attributeValueSeqNumber":1,"promotionAttributeName":"PROMOTION_FINAL_COST","attributeValue":"Never Show"}]}],"validWithOtherPromotions":true,"incompatiblePromotionIds":[],"sequenceNumber":0,"maxTimesToApply":0,"gwp":false}}}}