{
  "bloomingdales": {
    "info_exclusions_top_banner": "Subject to credit approval. The new account discount (the \"Discount\") is valid on merchandise purchases made at Bloomingdale's the day you are approved and the following day and charged on your new Bloomingdale's Account. The Discount cannot be combined with other discount offers except where indicated and it may not be applied to previous purchases. The Discount does not apply to services, certain licensed departments and Gift Cards. The Discount savings is limited to a total of $250. Applicants must qualify for immediate approval to receive the Discount; applications requiring further processing will not be eligible. Employees of Bloomingdale's and its affiliates are not eligible. The Discount percentage may differ for purchases made in our stores and on bloomingdales.com. For your convenience and record keeping, the Discount will appear on your statement. It will not appear on your register receipts or during checkout on bloomingdales.com.",
    "info_exclusions_six_points": "U.S. Bloomingdale's stores only. Double Points are not earned on shoe purchases from Bloomingdale's the Outlet Store or the outlet store page of bloomingdales.com. Points are not earned in Nespresso shops, at restaurants in Bloomingdale's, on store services, sales tax, or when redeeming Bloomingdale's Gift and Reward Cards. On December 31 of each year, 75% of all remaining points on your account will be forfeited. See Bloomingdale's Loyallist Program Terms and Conditions for complete details at bloomingdales.com/loyallist/termsandconditions.",
    "info_exclusions_three_points": "U.S. Bloomingdale's stores only. Double Points are not earned on shoe purchases from Bloomingdale's the Outlet Store or the outlet store page of bloomingdales.com. Points are not earned in Nespresso shops, at restaurants in Bloomingdale's, on store services, sales tax, or when redeeming Bloomingdale's Gift and Reward Cards. On December 31 of each year, 75% of all remaining points on your account will be forfeited. See Bloomingdale's Loyallist Program Terms and Conditions for complete details at bloomingdales.com/loyallist/termsandconditions.",
    "info_exclusions_even_more": "Power Points will be added to your Reward Account Balance as disclosed at the time a Power Points offer is extended by Bloomingdale's. Bloomingdale's is under no obligation to make any Power Points offers.",
    "info_exclusions_shipping": "Purchases must be made with your Bloomingdale's Credit Card or Loyallist ID. Free standard shipping on bloomingdales.com purchases shipped to a single U.S. address, excluding Bloomingdale's Gift Cards, furniture, and mattresses. Offer not valid on prior purchases. In-store shipping offer only applies to merchandise that is not available in the store where the order is placed, but is available at another Bloomingdale's Department Store location. Additional delivery charges may apply for expedited shipping. Bloomingdale's may terminate this benefit at any time without notice. Free returns everyday on online orders. Offer excludes gift cards, furniture, mattresses, mirrors, lamps and wall art. Only valid when shipping within the U.S.",
    "info_exclusions_rewards": "Reward Cards cannot be redeemed in Nespresso shops, exchanged for cash, used to purchase Bloomingdale's Gift Cards, or used as payment on Bloomingdale's account balance(s). Your Total Points Balance must equal at least 5,000 points to receive a Reward Card.",
    "credit_services_addtocard_wallet_text": "bWallet stores all your offers & payment options in one place, so you never miss a chance to save.",
    "credit_services_addoffers_text": "sdfs",
    "tra3_header_message": "UPDATE YOUR WALLET WITH YOUR BLOOMINGDALE'S AMERICAN EXPRESS CARD",
    "tra3_body_message" : "As you requested, we recently mailed you a Bloomingdale's American Express Card. This card replaces your Bloomingdale's Credit Card. Be sure to add your replacement card to My Wallet for all of your future purchases.",
    "trb3_header_message":"USE YOUR BLOOMINGDALE'S AMERICAN EXPRESS CARD FOR YOUR ONLINE PURCHASES.",
    "trb3_body_message": "We recently mailed you a Bloomingdale's American Express Card, which replaces the Bloomingdale's Credit Card you have entered in My Wallet. Be sure to add this replacement card to My Wallet for all of your future purchases.",
    "notice_text": "NOTICE: Because you added your Bloomingdale's Credit Card to your bloomingdales.com account, the above information about your Bloomingdale's credit card is visible on bloomingdales.com. Anyone with access to your bloomingdales.com sign-in will have access to this information. Do not give your bloomingdales.com sign-in to anyone you do not want to have access to this information. If you are concerned about this, you should change your password or contact customer service at 1-888-257-6757.",
    "AmexCard_disclaimer_text":"American Express is a federally registered service mark of American Express and is used by Department Stores National Bank pursuant to a license. The Bloomingdale's American Express Card program is issued and administered by Department Stores National Bank.",
    "authorized_indicator":"Authorized User",
    "pa_payment_message":"Your autopayment of $<sched_payment_amount> is currently processing",
    "OTP1_disclaimer":"Payments authorized prior to 11:59 PM Eastern Time will be posted as paid as of today's date. Payments authorized after 11:59PM ET will be posted as paid as of tomorrow's date. Note that if you are already enrolled in AutoPay, and you submit a separate one-time payment here, it will process in addition to your auto-payment.",
    "OTP2_disclaimer":"I authorize Department Stores National Bank to initiate, and my financial institution to honor an electronic payment in the amount specified above from my bank account on record. This authority pertains to the Macy's Credit Card or Macy's American Express® Card account noted above. Verify your information carefully.",
    "ss_payment_message":"You have a scheduled payment of $<sched_payment_amt> for <sched_payment_date>.View details",
    "ms_payment_message": "You have scheduled multiple payments. Your next payment of $<sched_payment_amount> is scheduled for <sched_payment_date>.View details",
    "ps_payment_message": "A payment of <payment_amount> is processing today",
    "sa_statement_full_msg": "You have scheduled an autopayment of Statement Balance in Full on <sched_payment_date>.",
    "sa_min_pay_msg": "You have scheduled an autopayment of Minimum Payment Due on <sched_payment_date>.",
    "sa_min_pay_fixed_msg": "You have scheduled an autopayment of Minimum Payment Due plus a fixed dollar amount on <sched_payment_date>.",
    "sa_other_amount_msg":"You have scheduled an autopayment for <sched_payment_date>.View details",
    "sa_known_amount_msg":"You have scheduled an autopayment of $<sched_payment_amount> for <sched_payment_date>.View details",
    "ma_known_amount_msg":"You have scheduled multiple payments, including a monthly autopayment. Your next payment is for  $<sched_payment_amount> on <sched_payment_date>.View details",
    "ma_unknown_amount_msg":"You have scheduled multiple payments, including a monthly autopayment. Your next payment is scheduled for <sched_payment_date>.View details",

  }
}