{
  "macys": {
    "LS1": "ACTION NEEDED: Our records indicate you reported a Macy's Credit Card as lost or stolen.Your replacement card will be automatically registered for online management when you go to the Credit Summary Page.",
    "LS_Indicator": "Card Reported Lost or Stolen",
    "credit_services_addtocard_wallet_text": "We noticed that this card is not in your Macy's wallet. Add it now and select Macy's Star Passes will be automatically added so you can use them online & in stores!",
    "credit_services_addoffers_text": "When you're ready to checkout online or in-store. MyWallet helps you pick the best offer every time!",
    "tra1_header_message": "Your new Macy’s American Express® Card will replace your Macy’s Credit Card.",
    "tra2_header_message": "Your Macy’s American Express® Card replaces your Macy’s Credit Card.",
    "trb1_header_message": "You’ve been upgraded to a Macy’s American Express® Card! ",
    "trb2_header_message": "You’ve been upgraded to a Macy’s American Express® Card.",
    "tra1_body_message": "You recently accepted an offer to upgrade your Macy’s Credit Card to a Macy’s American Express Card. Your new card is in the mail and should arrive in approximately 10 days. Any existing account balance is now reflected in your Macy’s American Express Card credit summary information.  Be sure to activate your card when it arrives and add it to your online wallet.",
    "tra2_body_message": "You recently accepted an offer to upgrade your Macy’s Credit Card to a Macy’s American Express Card. Any existing account balance is now reflected in your Macy’s American Express Card credit summary information. Be sure to activate your card and add it to your online wallet.",
    "trb1_body_message": "We mailed you information about this upgrade several weeks ago. This card will replace your Macy’s Credit Card and should arrive in approximately 10 days. Any existing account balance is now reflected in your Macy’s American Express Card credit summary information. Be sure to activate your card when it arrives and add it to your online wallet. ",
    "trb2_body_message": "This will replace your Macy’s Credit Card. We mailed you information about this upgrade several weeks ago. Any existing account balance is now reflected in your Macy’s American Express Card credit summary information. Please be sure to activate this card, add it to your online wallet, and use it for all future purchases.",
    "tra3_header_message": "Please add your Macy’s American Express® Card to your wallet.",
    "tra3_body_message" : "At your request, a Macy's American Express Card was recently mailed to you to replace your Macy's Credit Card. Please remove your Macy’s Credit Card from your online wallet, and add your new Macy’s American Express Card.",
    "trb3_header_message":"Please add your Macy’s American Express® Card to your wallet.",
    "trb3_body_message": "You recently received a Macy’s American Express Card to replace your Macy’s Credit Card. We mailed you information about this upgrade several weeks ago. Please remove your Macy’s Credit Card from your online wallet, and add your new Macy’s American Express Card.",
    "AmexCard_disclaimer_text":"American Express is a federally registered service mark of American Express and is used by Department Stores National Bank pursuant to a license. The Macy's American Express Card program is issued and administered by Department Stores National Bank.",
    "notice_text": "NOTICE: Because you added your Macy's Credit Card to your macys.com account, the above information about your Macy's credit card is visible on macys.com. Anyone with access to your macys.com sign-in will have access to this information. Do not give your macys.com sign-in to anyone you do not want to have access to this information. If you are concerned about this, you should change your password or contact customer service at 1-888-257-6757.",
    "authorized_indicator":"Authorized User",
    "ss_payment_message":"You have a scheduled payment of $<sched_payment_amt> on <sched_payment_date>.",
    "ms_payment_message": "You have multiple scheduled payments, with your next payment of $<sched_payment_amt> on <sched_payment_date>.",
    "ps_payment_message": "A payment of $<sched_payment_amt> is processing today, <sched_payment_date>.",
    "sa_statement_full_msg": "You have scheduled an autopayment of Statement Balance in Full on <sched_payment_date>.",
    "sa_min_pay_msg": "You have scheduled an autopayment of Minimum Payment Due on <sched_payment_date>.",
    "sa_min_pay_fixed_msg": "You have scheduled an autopayment of Minimum Payment Due plus a fixed dollar amount on <sched_payment_date>.",
    "sa_other_amount_msg":"You have scheduled an autopayment on <sched_payment_date>.",
    "sa_known_amount_msg":"You have scheduled an autopayment of $<sched_payment_amount> on <sched_payment_date>.",
    "ma_known_amount_msg":"You have multiple scheduled payments. Your next payment of $<sched_payment_amount> is scheduled for <sched_payment_date>.",
    "ma_unknown_amount_msg":"You have multiple scheduled payments. Your next payment is scheduled for <sched_payment_date>.",
    "pa_payment_message":"Your autopayment of $1,234.00 is currently processing",
    "OTP1_disclaimer":"Payments authorized prior to 11:59 PM Eastern Time will be posted as paid as of today's date. Payments authorized after 11:59PM ET will be posted as paid as of tomorrow's date. Note that if you are already enrolled in AutoPay, and you submit a separate one-time payment here, it will process in addition to your auto-payment.",
    "OTP2_disclaimer":"I authorize Department Stores National Bank to initiate, and my financial institution to honor an electronic payment in the amount specified above from my bank account on record. This authority pertains to the Macy's Credit Card or Macy's American Express® Card account noted above. Verify your information carefully."
  }
}